app/Controllers/Keranjang.php

    public function index()
    {
        $sess_user = $this->session->get('LoggedUserData');

        $data_keranjang = $this->keranjangModel
            ->join('produk', 'produk.id_produk = keranjang.id_produk', 'LEFT')
            ->where('id_user', $sess_user['id_user'])
            ->get();
---
SELECT *
FROM `keranjang`
LEFT JOIN `produk` ON `produk`.`id_produk` = `keranjang`.`id_produk`
WHERE `id_user` = '1'

    private function tambahkan_keranjang()
    {
        $produkModel = new \App\Models\ProdukModel();

        // cek id produk valid atau tidak
        $cek_data_produk = $produkModel
        ->where('id_produk', $_GET['id_produk'])
        ->first();

        if ($cek_data_produk == null) {
            $proses_db = null;
        } else {
            $sess_user = $this->session->get('LoggedUserData');

            // cek produk sudah ada di keranjang user atau tidak
            $cek_keranjang = $this->keranjangModel
            ->where('id_user', $sess_user['id_user'])
            ->where('id_produk', $_GET['id_produk'])
            ->first();
---
SELECT *
FROM `produk`
WHERE `id_produk` = '3'
 LIMIT 1
SELECT *
FROM `keranjang`
WHERE `id_user` = '1'
AND `id_produk` = '3'
 LIMIT 1

                    'jumlah_beli' => $cek_keranjang['jumlah_beli'] + 1
                ];

                $proses_db = $this->keranjangModel->update($cek_keranjang['id_keranjang'], $data_inputan_keranjang);
---
UPDATE `keranjang` SET `jumlah_beli` = 2
WHERE `keranjang`.`id_keranjang` IN ('2')