app/Controllers/Login.php

SELECT *
FROM `user`
WHERE `username` = 'admin'
AND `password` = 'b1b3773a05c0ed0176787a4f1574ff0075f7521e'
 LIMIT 1
UPDATE `user` SET `last_login` = '2024-01-06 00:06:31'
WHERE `user`.`id_user` IN ('1')
---
    public function proses_login()
	{
		$username = $this->request->getPost('username');
		$pass = $this->request->getPost('password');

		$validasi = $this->userModel
		->where('username', $username)
		->where('password', sha1($pass))
		->first();

		if ($validasi == null) {
			$pesan = 'Kesalahan : Data pengguna tidak ada';
			$this->session->setFlashdata('msg', $pesan);

			return redirect()->to(base_url('login'));
		} else {
			$userdata = [
				'nama' => $validasi['nama'],
				'username' => $validasi['username'],
				'id_user' => $validasi['id_user'],
			];
			$this->session->set("LoggedUserData", $userdata);

			$data_update = ['last_login' => date("Y-m-d H:i:s")];

			$update_login = $this->userModel->update($validasi['id_user'], $data_update);