app/Controllers/Produk.php

    public function index()
    {
        if (isset($_COOKIE['produk'])) {
            $arr_produk = json_decode($_COOKIE['produk'], true);
        } else {
            $arr_produk = [];
        }

        $pencarian_id_produk = !isset($_GET['cari'])?'':$_GET['cari'];

        $arr_produk = $this->produkModel
        ->like('kode_produk', $pencarian_id_produk)
        ->get();
---
SELECT *
FROM `produk`
WHERE `kode_produk` LIKE '%%' ESCAPE '!'

            }

            if ($id_produk_pk == '') {
                $proses_db = $this->produkModel->insert($produk_baru);
---
INSERT INTO `produk` (`kode_produk`, `nama_produk`, `deskripsi`, `stok`, `harga`, `foto_produk`) VALUES ('Pr-321', 'Pdsff', 'sdfds', '43', '233', '2024_01_06_00_07_13_57.png')